In [1]:
import pandas as pd

In [3]:
air_quality = pd.read_csv("air_quality_no2.csv", index_col=0, parse_dates=True)

In [4]:
air_quality.head()

                     station_antwerp  station_paris  station_london
datetime
2019-05-07 02:00:00              NaN            NaN            23.0
2019-05-07 03:00:00             50.5           25.0            19.0
2019-05-07 04:00:00             45.0           27.7            19.0
2019-05-07 05:00:00              NaN           50.4            16.0
2019-05-07 06:00:00              NaN           61.9             NaN

In [6]:
air_quality["london_mg_per_cubic"] = air_quality["station_london"]

In [7]:
air_quality.head()

,station_antwerp,station_paris,station_london,london_mg_per_cubic
datetime,,,,
2019-05-07 02:00:00,NaN,NaN,23.0,23.0
2019-05-07 03:00:00,50.5,25.0,19.0,19.0
2019-05-07 04:00:00,45.0,27.7,19.0,19.0
2019-05-07 05:00:00,NaN,50.4,16.0,16.0
2019-05-07 06:00:00,NaN,61.9,NaN,NaN

To create a new column that is already on the table use the name of the old column and the name of new column and using brackets add it to the graph. Very similar to regualr python coding.

In [8]:
air_quality["ratio_paris_antwerp"] = (
    air_quality["station_paris"] / air_quality["station_antwerp"]
)

In [9]:
air_quality.head()

,station_antwerp,station_paris,station_london,london_mg_per_cubic,ratio_paris_antwerp
datetime,,,,,
2019-05-07 02:00:00,NaN,NaN,23.0,23.0,NaN
2019-05-07 03:00:00,50.5,25.0,19.0,19.0,0.495050
2019-05-07 04:00:00,45.0,27.7,19.0,19.0,0.615556
2019-05-07 05:00:00,NaN,50.4,16.0,16.0,NaN
2019-05-07 06:00:00,NaN,61.9,NaN,NaN,NaN

## Star I want to change the names of the columns to the corresponding station identifers how do i do it?

In [11]:
air_quality_renamed = air_quality.rename(
    columns={
        "station_antwerp": "BETR801",
        "station_paris": "FR04014",
        "station_london": "London Westminster",
    }
)

In [12]:
air_quality_renamed.head()

,BETR801,FR04014,London Westminster,london_mg_per_cubic,ratio_paris_antwerp
datetime,,,,,
2019-05-07 02:00:00,NaN,NaN,23.0,23.0,NaN
2019-05-07 03:00:00,50.5,25.0,19.0,19.0,0.495050
2019-05-07 04:00:00,45.0,27.7,19.0,19.0,0.615556
2019-05-07 05:00:00,NaN,50.4,16.0,16.0,NaN
2019-05-07 06:00:00,NaN,61.9,NaN,NaN,NaN

In [13]:
air_quality_all = air_quality_renamed.rename(
    columns={
        "london_mg_per_cubic": "london_cubic",
        "ratio_paris_antwerp": "ratios"
    }
)

In [15]:
air_quality_all.head()

,BETR801,FR04014,London Westminster,london_cubic,ratios
datetime,,,,,
2019-05-07 02:00:00,NaN,NaN,23.0,23.0,NaN
2019-05-07 03:00:00,50.5,25.0,19.0,19.0,0.495050
2019-05-07 04:00:00,45.0,27.7,19.0,19.0,0.615556
2019-05-07 05:00:00,NaN,50.4,16.0,16.0,NaN
2019-05-07 06:00:00,NaN,61.9,NaN,NaN,NaN

Details about column or row label renaming is provided in the user guide section of the docs under renaming labels.

In [16]:
titanic = pd.read_csv("titanic.csv")

In [17]:
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [20]:
my_titanic = pd.read_csv("titanic.csv", index_col=0)

In [21]:
my_titanic.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

## Summary Stats

What is the average age of the titanic passengers?

In [22]:
titanic["Age"].mean()

29.69911764705882

You identify the column with the age title and the average is returned to you as nesscary.

This is going to be important Star what is the differnce between median and mean in math you are going back in time.

Median if the literal number in the middle of a list. The list is ordered from smallest to largest and than literally cut in half. whereas the mean is the avergae in a large set of numbers.

In [23]:
titanic[["Age", "Fare"]].median()

Age     28.0000
Fare    14.4542
dtype: float64

In [24]:
titanic[["Age", "Fare"]].describe()

              Age        Fare
count  714.000000  891.000000
mean    29.699118   32.204208
std     14.526497   49.693429
min      0.420000    0.000000
25%     20.125000    7.910400
50%     28.000000   14.454200
75%     38.000000   31.000000
max     80.000000  512.329200

In [25]:
titanic.agg(
    {
        "Age": ["min", "max", "median", "skew"],
        "Fare": ["min", "max", "median", "mean"],
    }
)

              Age        Fare
min      0.420000    0.000000
max     80.000000  512.329200
median  28.000000   14.454200
skew     0.389108         NaN
mean          NaN   32.204208

If you want to read more aboout statistics feel free to read the docs under the section entitled descriptive stats.

In [26]:
titanic[["Sex", "Age"]].groupby("Sex").mean()

              Age
Sex
female  27.915709
male    30.726645

As our intrest is the average age for each gender a subselection on these two columns is made by selecting "Sex" and than "Age". After that the groupby method is applied on the sex column to make a group per category.

## Many ways to get this result

In [27]:
titanic.groupby("Sex").mean()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
Sex,,,,,,,
female,431.028662,0.742038,2.159236,27.915709,0.694268,0.649682,44.479818
male,454.147314,0.188908,2.389948,30.726645,0.429809,0.235702,25.523893

In [28]:
titanic.groupby("Sex")["Age"].mean()

Sex
female    27.915709
male      30.726645
Name: Age, dtype: float64

In [29]:
titanic.groupby(["Sex", "Pclass"])["Fare"].mean()

Sex     Pclass
female  1         106.125798
        2          21.970121
        3          16.118810
male    1          67.226127
        2          19.741782
        3          12.661633
Name: Fare, dtype: float64

Grouping can be done by mutiple columns at the same time. Provide the column names as a list to the groupby() method.

If your an idiot and dont understand or want to learn more go to the docs groupby operations.

In [31]:
titanic["Sex"].value_counts()

male      577
female    314
Name: Sex, dtype: int64

In [32]:
titanic["Pclass"].value_counts()

3    491
1    216
2    184
Name: Pclass, dtype: int64

In [33]:
titanic.groupby("Pclass")["Pclass"].count()

Pclass
1    216
2    184
3    491
Name: Pclass, dtype: int64

## Many ways to get the same answer so beautiful

Both size and count can be used in combination with groupby. Whereas size includes NaN values and just provides the number of rows (size of the table), count excludes the missing values. In the values_counts method used the dropna argument to include or exlude the NaN values.

## groupby provides the power of the split-apply-combine pattern

Fun

cool

In [39]:
air_quality = pd.read_csv(
    "air_quality_long.csv", index_col="date.utc", parse_dates=True)
)

SyntaxError: unmatched ')' (4218681978.py, line 3)